---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltDiameterLongerFlange
source: html/e61f8884-18c8-ca5c-5982-e3b2127f91c2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltDiameterLongerFlange Property

"Bolt Diameter Longer Flange"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionLangleBoltDiameterLongerFlange { get; }
```